
SELECT
    [Проводка].[Входит в сумму] [Входит в сумму],
    [Проводка.Вид].[Номер и название] [Вид провоки],
    [Проводка.Дебет].[Номер] [ДБ],
    dbo.[Субконто.Номер и название]([Проводка].[Дб тип субконто 1],[Проводка].[Дб субконто 1],'<Нет>') [Дб субконто],
    [Проводка.Кредит].[Номер] [КР],
    [Проводка].[Сумма] [Сумма],
    [Проводка.Валюта].[Название] [Вал],
    [Проводка].[Дата] [Дата],
    [Проводка].[Примечание] [Примечание],
    [Проводка].[Ключ] [InternalRecordID],
    [Проводка].[ГенТип] [ГенТип],
    [Проводка].[Вид] [InternalRecordVid],
    [Проводка].[Юр.лицо] [InternalRecordKontora],
    [Проводка].[Дебет] [Дебет_счет_доступ],
    [Проводка].[Кредит] [Кредит_счет_доступ]
FROM [Проводка] [Проводка] WITH(NOLOCK)
LEFT OUTER JOIN [Вид проводки view] [Проводка.Вид]  WITH(NOLOCK)
ON [Проводка.Вид].[Ключ]=[Проводка].[Вид]
LEFT OUTER JOIN [Счет view] [Проводка.Дебет]  WITH(NOLOCK)
ON [Проводка.Дебет].[Ключ]=[Проводка].[Дебет]
LEFT OUTER JOIN [Счет view] [Проводка.Кредит]  WITH(NOLOCK)
ON [Проводка.Кредит].[Ключ]=[Проводка].[Кредит]
LEFT OUTER JOIN [Валюта view] [Проводка.Валюта]  WITH(NOLOCK)
ON [Проводка.Валюта].[Ключ]=[Проводка].[Валюта]
WHERE
  1=1
  AND ([Проводка].[Дата] = {{description}})
  AND ([Проводка].[Дата] LIKE '%[[890]]%')
GO
SELECT [Проводка].[Входит в сумму] [Входит в сумму],
      go
SELECT int1 {{int1}}
SELECT float2 {{float2}}
SELECT b1 {{bol1}}
SELECT b32 {{болbolй0}}

{{#each arr}}
    SELECT arr0 {{this}}
{{/each}}

select date1={{createdDate}}
select datetime1={{createdDateTime}}
select guid1={{guid1}}
select pic1={{pic1}}

