-- запрос: buhta/core-tests/schema/СписокОрганизаций.query.json

/************** SQL-before: начало **************/
USE [MAG3666]
GO

SET ANSI_NULLS ON
GO

/************** SQL-before: конец  **************/

SELECT
    [Организация].[Номер] AS [Номер],
    [Организация].[Название] AS [Название],
    [Организация.Сотрудник].[Номер] AS [ДирНомер178],
    [Организация.Сотрудник].[Фамилия] AS [Дир-Фамилия],
    [Организация.Сотрудник].[Отчество] AS [Отчество],
    [Организация.Сотрудник].[ИНН] AS [ИНН],
    [Организация.Сотрудник].[ДатаРождения] AS [Рожд],
    [Организация].[Ключ] AS [__recordId__],
    /************** SQL-select: начало **************/
    '222'+[Организация.Сотрудник].[Фамилия] AS [Дир-Фамилия],
    /************** SQL-select: конец  **************/
FROM
    [buhta_core_tests_schema_Организация] AS [Организация]
    LEFT JOIN [СотрXXX] AS [Организация.Сотрудник]
    ON [Организация].[Директор]=[Организация.Сотрудник].[Ключ]
    /************** SQL-join: начало **************/
    JOIN xxx on 1123=897
    
    /************** SQL-join: конец  **************/
WHERE
    /************** SQL-where: начало *************/
    234=456
    /************** SQL-where: конец  *************/

/************** SQL-after: начало **************/
ALTER  PROCEDURE [dbo].[Export_Add_Subconto]
  @SubcontoNum VARCHAR(32), 
  @SubcontoName VARCHAR(50), 
  @SubcontoID INT OUTPUT , 
  @SubcontoType VARCHAR(5) OUTPUT
AS
BEGIN
END
/************** SQL-after: конец  **************/
