-- запрос: buhta/zzz-tests/СписокОрганизаций.query

/************** SQL-before: начало **************/
-- ================
/************** SQL-before: конец  **************/

SELECT
    [Организация_MAG666].[Номер] AS [Номер],
    [Организация_MAG666].[Название] AS [Название],
    Номер+'--' AS [Строка5279],
    999 AS [Деньги5525],
    CASE 
  WHEN Ключ%2=0 THEN Номер+' '+ Название + STR(Ключ) 
  ELSE '' 
END AS [Строка3255],
    {{_ServerCurrentTime_}} AS [Строка7674],
    {{_UserIP_}} AS [Строка1988],
    [Организация_MAG666].[Ключ] AS [__recordId__]
FROM
    [ТМЦ] AS [Организация_MAG666]

